## Plan Result (sbox_landing)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_container_group.runner[&#34;00&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_group.runner["00"] will be created
  + resource "azurerm_container_group" "runner" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Private"
      + location                    = "uksouth"
      + name                        = "ingest00-runner-sbox"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "ingest00-management-sbox"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = [
          + "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox",
        ]
      + tags                        = {
          + "Data-Ingest-Project" = "example landing zone"
          + "application"         = "dlrm-data-ingest"
          + "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
          + "businessArea"        = "cross-cutting"
          + "criticality"         = "Low"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "startupMode"         = "always"
        }

      + container {
          + commands = (known after apply)
          + cpu      = 0.5
          + image    = "hmctspublic.azurecr.io/github-runner:prod-84d74135-1707147900"
          + memory   = 1.5
          + name     = "runner"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":21,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->